In [1]:
import pandas as pd

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [3]:
ser = pd.Series({'1':'Hussain','2':'ahmad','3':'mohammed'})

In [4]:
ser

1     Hussain
2       ahmad
3    mohammed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [5]:
ser.index = [11,12,13]
ser

11     Hussain
12       ahmad
13    mohammed
dtype: object

## Q3: Retrieve First and second elements.

In [7]:
ser[11]
ser[12]

'Hussain'

'ahmad'

## Q4: Add duplicate elements, then remove the duplication.

In [8]:
dup = pd.Series({'12':'ahmad'})
ser = ser.append(dup)
ser
ser.drop_duplicates()

/var/folders/5b/q18j38cx3nn0q3qbxnct7rx40000gn/T/ipykernel_60145/2505704880.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser = ser.append(dup)

11     Hussain
12       ahmad
13    mohammed
12       ahmad
dtype: object

11     Hussain
12       ahmad
13    mohammed
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [20]:
data = [[1,'HH','3/4']]
df = pd.DataFrame(data, columns='ID Name Gpa'.split())
df

   ID Name  Gpa
0   1   HH  3/4

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [10]:
educDf = pd.read_csv('educ_figdp_1_Data.csv')
educDf

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

Indexing:

In [11]:
educDf['TIME'][:5]

0    2000
1    2001
2    2002
3    2003
4    2004
Name: TIME, dtype: int64

loc:

In [24]:
educDf.loc[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e

using "loc" allows us to specify the slice based on the label or the index of a data frame.

Slicing:

In [14]:
educDf[:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

using slicing depends only on passed indecies. s